docs/2022/code_interview/training.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-06-22 Wed 02:48 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Leetcode Exercises</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Claudio Parra">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" type="text/css" href="/assets/style.css">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Leetcode Exercises</h1>
<nav class="nav">
<ul class="org-ul">
<li><a href="../../../../index.html">Back to Home</a></li>
</ul>
</nav>
<div id="outline-container-org71d62eb" class="outline-2">
<h2 id="org71d62eb"><code>[2/2]</code> Day 1</h2>
<div class="outline-text-2" id="text-org71d62eb">
</div>
<div id="outline-container-orgc72ae81" class="outline-3">
<h3 id="orgc72ae81"><span class="done DONE">DONE</span> Two Sum&#xa0;&#xa0;&#xa0;<span class="tag"><span class="easy">easy</span></span></h3>
<div class="outline-text-3" id="text-orgc72ae81">
<ul class="org-ul">
<li><a href="https://leetcode.com/problems/two-sum/">https://leetcode.com/problems/two-sum/</a></li>
<li><b>Runtime:</b> O(n) 71%</li>
<li><b>Memory:</b> O(n) 49%</li>
<li><p>
Use a dictionary to store potential matches for future numbers.
</p>
<pre class="example" id="org8a54bfd">
class Solution:
  def twoSum(self, nums: List[int], target: int) -&gt; List[int]:
      if not nums:
          raise Exception("The list 'nums' is empty")
      '''
      dict with pairs (&lt;number previously found&gt;, &lt;index of that number&gt;)
      for every number X in nums[], we will lookup this dictionary first to see
      whether we have seen the value (target-X) before.
      '''
      wanted = {}
      for j in range(len(nums)):
          looking_for = target - nums[j]
          if looking_for in wanted:
              return(wanted[looking_for],j)
          wanted[nums[j]] = j
      raise Exception("No pair found, you lied to me...")
      return
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-org134e981" class="outline-3">
<h3 id="org134e981"><span class="done DONE">DONE</span> Valid Parenthesis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="easy">easy</span></span></h3>
<div class="outline-text-3" id="text-org134e981">
<ul class="org-ul">
<li><b>Runtime:</b> O(n) 19%</li>
<li><b>Memory:</b> O(n) 69%</li>
<li>Use a stack to keep the open parenthesis in order.</li>
<li>if <code>([{</code>, then push. if <code>)]}</code>, check the correspondence and if ok, continue.</li>
<li><p>
Keep the pairs in a dictionary, that makes it easy to maintain.
</p>
<pre class="example" id="org310b249">
class Solution:
  def isValid(self, s: str) -&gt; bool:
      # openers will contain all the opening parenthesis that are
      # not closed yet.
      openers = []
      pairs = {'(':')', '[':']', '{':'}'}
      for par in s:
          if par in '([{':
              # opening, push to stack
              openers.append(par)
          elif openers:
              # closing AND there is at least one opener in the stack.
              # check the corresponding opener
              if pairs[openers.pop()] != par:
                  return False
          else:
              # closing BUT the stack of openers is empty.
              # This is a disbalance in the force...
              return False

      # at this point nest_stack should be empty, because all parethesis
      # should have closed with their matching pairs
      if openers:
          return False
      return True
</pre></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
